{
    "my-language-journey": {
        "title": "My Language Learning Journey",
        "detailed": "My love for language learning began with my very first Spanish class at Ohio University when I was just 15 years old. Until then, I knew very little about Hispanic cultures or Latin America, and I certainly did not expect that one class would open my eyes to an entirely different world. Each lesson went beyond grammar and vocabulary. It included cultural insights, from daily life to ancient history. That was when I first discovered how deeply language and culture are connected, and how learning one can unlock a richer understanding of the other.\n\nI continued to study Spanish for three more years, but after my first year I also added Japanese to my schedule. Since I had started full-time college at 13, my Computer Science major left me plenty of room to take additional language classes. Studying Japanese gave me not only a foundation in the language but also a window into Japanese culture. I joined Ohio University’s Japanese Language and Culture Association, where I became friends with several Japanese exchange students. These friendships gave me valuable opportunities to practice and learn outside the classroom. I had even planned to study abroad in Japan in 2020, but those plans were unfortunately canceled due to the COVID-19 pandemic.\n\nThat same year, I began studying Mandarin Chinese. Once again, language study opened the door to a deeper appreciation of a new culture. After graduation, I continued with weekly online Mandarin classes to keep building fluency and expanding my global perspective."
    },
    "ongoing-practice": {
        "title": "Ongoing Practice and Development",
        "detailed": "Keeping my languages sharp and continuing to learn is one of my top priorities. I focus most on Chinese since I studied it the least in college. Every week I take an online class with my teacher from the Columbus School of Chinese, and I prepare in advance so I can ask meaningful questions. In each lesson we usually discuss a passage or a short podcast that mixes new and familiar vocabulary. This gives me the chance to practice speaking on a topic while also improving my listening skills and using context clues to understand unfamiliar words.\n\nFor Spanish and Japanese, I maintain fluency through interactions with my Japanese-Peruvian in-laws and friends, most of whom do not speak English. This keeps me from falling back on the language I am most comfortable with. I also read books and watch TV shows in both languages without subtitles. Since I already have a strong grasp of grammar, my main focus is on expanding vocabulary."
    }
}