{
    "my-language-journey": {
        "title": "Mi viaje en el aprendizaje de idiomas",
        "detailed": "Mi amor por aprender idiomas empezó con mi primera clase de español en la Universidad de Ohio cuando tenía solo 15 años. Hasta ese momento, sabía muy poco sobre las culturas hispanas o sobre América Latina, y no me esperaba que una sola clase me abriera los ojos a un mundo completamente diferente. Cada lección me enseñaba mucho más que gramática y vocabulario. Incluía apectos culturales, desde la vida cotidiana hasta la historia antigua. En esa clase descubrí por primera vez que la cultura y el idioman están profundamente ligados, y que aprender uno puede darte una comprensión más profunda del otro.\n\nContinué estudiando español durante tres años màs. Después de mi primer año, también empecé a estudiar japonés. Como había empezado la universidad a los 13 años, incluso estudiando Ciencias de la Computación tenía tiempo para dedicarlo a otros idiomas. Estudiar japonés no solo me dio una base en el idioma, sino también la oportunidad de aprender más sobre la cultura japonesa. Me uní a la Asociación de Lengua y Cultura Japonesa de la universidad e hice amistad con varios estudiantes de intercambio japoneses. Esas amistades me dieron oportunidades de practicar japonés y aprender fuera del aula. Incluso planeaba estudiar en Japón en 2020, pero esos planes se cancelaron debido a la pandemia de COVID-19.\n\nEse mismo año empecé a estudiar chino mandarín. Una vez más, el estudio de un idioma me abrió la puerta a una apreciación más profunda de una nueva cultura. Después de graduarme, continué tomando clases virtuales de chino cada semana para seguir desarrollando mi fluidez y ampliar mi perspectiva global."
    },
    "ongoing-practice": {
        "title": "Práctica continua y desarrollo",
        "detailed": "Mantenar mis idiomas y seguir aprendiendo es una de mis principales prioridades. Me enfoco especialmente en el chino porque fue el idioma que menos estudié en la universidad. Cada semana tomo una clase en línea con mi profesor de la Escuela de Chino de Columbus, y me preparo con anticipación para poder formular preguntas útiles. En cada lección solemos trabajar con un texto o un pódcast corto que combina vocabulario nuevo con vocabulario ya conocido. Esto me da la oportunidad de practicar la expresión oral sobre un tema y, al mismo tiempo, mejorar mi capacidad de escucha y usar las pistas del contexto para comprender palabras nuevas.\n\nPara el español y el japonés, mantengo mi fluidez a través de interacciones con mis suegros y amigos japoneses-peruanos, la mayoría de los cuales no hablan inglés. Esto evita que me apoye en el idioma en el que me siento más cómodo. También leo libros y veo programas de televisión en ambos idiomas sin subtítulos. Como ya tengo una base sólida de gramática, mi objetivo principal es ampliar mi vocabulario."
    }
}